Revit 2027 API
Category.HasMaterialQuantities Property
 Identifies if elements of the category are able to report what materials they contain in what quantities.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasMaterialQuantities { get; }
Public ReadOnly Property HasMaterialQuantities As Boolean
	Get
public:
property bool HasMaterialQuantities {
	bool get ();
}
member HasMaterialQuantities : bool with get
Property Value
Boolean
Remarks
 Get materials via the Element' property Materials; Get quantities via methods GetMaterialArea and GetMaterialVolume.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace